---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FailureMessage
source: html/092161ab-4f4a-f5ad-8c9f-7edcda0818fe.htm
---
# FailureMessage Members

Creates a new FailureMessage related to a given FailureDefinition.